'use client';

const TypographyPage = () => (
  <div className="flex flex-wrap flex-col gap-5 h-full w-[calc(100vw-400px)]">
    <h1 className="text-h1 font-bold">Теплофизика — совокупность дисциплин</h1>
    <h2 className="text-h2 font-bold">Теплофизика — совокупность дисциплин</h2>
    <h3 className="text-h3 font-bold">Теплофизика — совокупность дисциплин</h3>
    <h4 className="text-h4 font-bold">Теплофизика — совокупность дисциплин</h4>
    <h5 className="text-h5 font-bold">Теплофизика — совокупность дисциплин</h5>
    <h6 className="text-h6 font-bold">Теплофизика — совокупность дисциплин</h6>

    <p className="text-xl-base">Теплофизика — совокупность дисциплин, представляющих теоретические основы энергетики. Включает термодинамику, теплообмен, методы экспериментального и теоретического исследования равновесных и неравновесных состояний веществ и тепловых процессов.</p>
    <p className="text-l-base">Теплофизика — совокупность дисциплин, представляющих теоретические основы энергетики. Включает термодинамику, теплообмен, методы экспериментального и теоретического исследования равновесных и неравновесных состояний веществ и тепловых процессов.</p>
    <p className="text-m-base">Теплофизика — совокупность дисциплин, представляющих теоретические основы энергетики. Включает термодинамику, теплообмен, методы экспериментального и теоретического исследования равновесных и неравновесных состояний веществ и тепловых процессов.</p>
    <p className="text-s-base">Теплофизика — совокупность дисциплин, представляющих теоретические основы энергетики. Включает термодинамику, теплообмен, методы экспериментального и теоретического исследования равновесных и неравновесных состояний веществ и тепловых процессов.</p>
    <p className="text-xs-base">Теплофизика — совокупность дисциплин, представляющих теоретические основы энергетики. Включает термодинамику, теплообмен, методы экспериментального и теоретического исследования равновесных и неравновесных состояний веществ и тепловых процессов.</p>
    <p className="text-xxs-base">Теплофизика — совокупность дисциплин, представляющих теоретические основы энергетики. Включает термодинамику, теплообмен, методы экспериментального и теоретического исследования равновесных и неравновесных состояний веществ и тепловых процессов.</p>
  </div>
);

export default TypographyPage;
